projectDesign/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    lowerWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    upperWall
    {
        type            calculated;
        value           uniform 0;
    }
    trailer
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    cabin
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    wheel_fl
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    wheel_fr
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    wheel_rl
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    wheel_rr
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    wheel_mr
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    wheel_ml
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
