projectDesign/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
  force
  {
      type forces;
      enabled yes;
      libs ("libforces.so");
      log yes;
      patches (truck wheel_rear wheel_front wheel_middle);
      rho rhoInf;
      rhoInf 1;

      writeControl timeStep;
      writeInterval 1;

      liftDir (1 0 0);
      dragDir (0 1 0);
      CofR  (0 0 0);
  }

    residuals
   {
     type residuals;
     enabled yes;
     fields (p U k epsilon);
     libs ("libutilityFunctionObjects.so");
   }

}


// ************************************************************************* //
